Practicas/PracticasGretl/Prct-Lecc02.org
#+title:  Lección 2
#+author: Marcos Bujosa
#+STARTUP: show4levels
#+LANGUAGE: es-es

#+EXPORT_FILE_NAME: pub/Prct-Lecc02

# +OPTIONS: toc:nil
#+OPTIONS: tags:nil

#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LaTeX_HEADER: \usepackage[svgnames,x11names]{xcolor}
#+LaTeX_HEADER: \hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
#+LaTeX_HEADER: \PassOptionsToPackage{hyphens}{url}
# +LaTeX_HEADER: \input{notacionLinAlg.tex}
#+LaTeX_HEADER: \usepackage{nacal}

#+LaTeX_HEADER: \usepackage{framed}

#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \input{hansl.tex}
#+LaTeX_HEADER: \lstnewenvironment{hansl-gretl}
#+LaTeX_HEADER: {\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
#+LaTeX_HEADER: {}
#+LaTeX_HEADER: \newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{white},basicstyle=\ttfamily\footnotesize,breaklines=true, captionpos=b,commentstyle=\color{mygreen},escapeinside={\%*}{*)}, keywordstyle=\color{blue},stringstyle=\color{mymauve}, }
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20},basicstyle=\ttfamily\footnotesize,breaklines=true, }
#+LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20}, }

#+name: setup-listings
#+begin_src emacs-lisp :exports none :results silent
  (setq org-latex-listings 'listings)
  (setq org-latex-custom-lang-environments
  	;'((emacs-lisp "common-lispcode")))
  	'((emacs-lisp "hansl-gretl")))
  (setq org-latex-listings-options
	'(("frame" "lines")
	  ("basicstyle" "\\scriptsize")
	  ("basicstyle" "\\ttfamily")
	  ("numbers=none" "left")
	  ("backgroundcolor=\\color{lightgray!20}")
	  ("numberstyle" "\\tiny")))
  (setq org-latex-to-pdf-process
	'("pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"))
  (org-add-link-type
   "latex" nil
   (lambda (path desc format)
     (cond
      ((eq format 'html)
       (format "<span class=\"%s\">%s</span>" path desc))
      ((eq format 'latex)
       (format "\\%s{%s}" path desc)))))
#+end_src

# \lstnewenvironment{code}
#     {\lstset{language=haskell,
#     basicstyle=\small\ttfamily,
#     numbers=left,
#     numberstyle=\tiny\color{gray},
#     backgroundcolor=\color{lightgray},
#     firstnumber=auto
#     }}
#     {}

#+bibliography: ref.bib

# +latex: \clearpage


* Componentes no observables del número de viajeros internacionales
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/componentesAirlinePass.inp
   :END:

   | Guión: | [[https://github.com/mbujosab/EconometriaAplicada-SRC/blob/main/Practicas/PracticasGretl/pub/scripts/componentesAirlinePass.inp][componentesAirlinePass.inp]] |
   
Vamos a reproducir el ejemplo de estimación de componentes no
observables visto en clase. Los datos son mensuales y contienen el
número de viajeros internacionales (en miles) en las líneas aéreas
norteamericanas en los años 1949--1960 que aparece en manual de Box &
Jenkins.

***** Objetivo
1. Reproducir el ejemplo visto en la lección 2.

***** Carga de datos
*/~Archivo --> Abrir datos --> Archivo de muestra~/* y en la pestaña
*/~Gretl~/* seleccione =bjg=.

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
#+NAME: Lectura del fichero de datos
#+begin_src hansl 
open bjg
#+end_src
#+latex: }

** Actividad 1 - generar una serie con el índice temporal y su cuadrado
Pulse en el menú desplegable */~Añadir~/* que aparece arriba, en el centro de la
ventana principal de [[https://gretl.sourceforge.net/es.html][Gretl]].
  + */~Añadir -> Variable índices~/*

    #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
    /o bien teclee en linea de comandos/:
      #+NAME: Mostramos los valores de los datos en columna
      #+begin_src hansl
      genr time
      #+end_src
    #+latex: }

Seleccione con el ratón la variable =time= y luego pulse en el menú desplegable */~Añadir~/* que aparece arriba, en el centro de la
ventana principal de [[https://gretl.sourceforge.net/es.html][Gretl]].
  + */~Añadir -> Cuadrados de las variables seleccionadas~/*

    #+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
    /o bien teclee en linea de comandos/: 
      #+NAME: Aplicamos la transformación logarítmica
      #+begin_src hansl 
      square time
      #+end_src
    #+latex: }
 
#+latex: \vspace{-3pt}   

