docs/Practicas/PracticasGretl/Prct-Lecc02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es-es" xml:lang="es-es">
<head>
<!-- 2024-08-24 sáb 17:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lección 2</title>
<meta name="author" content="Marcos Bujosa" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Lección 2</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2222c82">1. Componentes no observables del número de viajeros internacionales</a>
<ul>
<li><a href="#org5e92e53">1.1. Actividad 1 - generar una serie con el índice temporal y su cuadrado</a></li>
<li><a href="#org3901aa5">1.2. Actividad 2 - Ajustar una tendencia lineal</a></li>
<li><a href="#org33f6491">1.3. Actividad 3 - Ajustar una tendencia cuadrática</a></li>
<li><a href="#orgc098b60">1.4. Actividad 4 - Ajustar una tendencia cuadrática y un componente estacional determinista</a></li>
</ul>
</li>
<li><a href="#orgdfa1996">2. Componentes no observables del número de viajeros internacionales 2</a>
<ul>
<li><a href="#orge9aa59e">2.1. Actividad 1 - Estime el modelo con tendencia cuadrática y estacionalidad determinista</a></li>
<li><a href="#orga83b09a">2.2. Actividad 2 - Reducir el modelo eliminando secuencialmente variables no significativas</a></li>
<li><a href="#org1b38cbd">2.3. Actividad 3 - Contrastar la ausencia de autocorrelación</a></li>
<li><a href="#orga9fb626">2.4. Actividad 4 - Estimación del modelo con errores estándar robustos</a></li>
<li><a href="#org5729c0a">2.5. Actividad 4 - Estimación incluyendo en el modelo la autocorrelación de orden uno en las perturbaciones</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2222c82" class="outline-2">
<h2 id="org2222c82"><span class="section-number-2">1.</span> Componentes no observables del número de viajeros internacionales</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Guión:</td>
<td class="org-left"><a href="https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/componentesAirlinePass.inp">componentesAirlinePass.inp</a></td>
</tr>
</tbody>
</table>

<p>
Vamos a reproducir el ejemplo de estimación de componentes no
observables visto en clase. Los datos son mensuales y contienen el
número de viajeros internacionales (en miles) en las líneas aéreas
norteamericanas en los años 1949&#x2013;1960 que aparece en manual de Box &amp;
Jenkins.
</p>
</div>
<ol class="org-ol">
<li><a id="org041ab7f"></a>Objetivo<br />
<div class="outline-text-6" id="text-1-0-0-0-1">
<ol class="org-ol">
<li>Reproducir el ejemplo visto en la lección 2.</li>
</ol>
</div>
</li>
<li><a id="org73b8123"></a>Carga de datos<br />
<div class="outline-text-6" id="text-1-0-0-0-2">
<p>
<b><i><code>Archivo --&gt; Abrir datos --&gt; Archivo de muestra</code></i></b> y en la pestaña
<b><i><code>Gretl</code></i></b> seleccione <code>bjg</code>.
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl" id="orgbe385f8">open bjg
</pre>
</div>
</div>
</li>
</ol>
<div id="outline-container-org5e92e53" class="outline-3">
<h3 id="org5e92e53"><span class="section-number-3">1.1.</span> Actividad 1 - generar una serie con el índice temporal y su cuadrado</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Pulse en el menú desplegable <b><i><code>Añadir</code></i></b> que aparece arriba, en el centro de la
ventana principal de <a href="https://gretl.sourceforge.net/es.html">Gretl</a>.
</p>
<ul class="org-ul">
<li><p>
<b><i><code>Añadir -&gt; Variable índices</code></i></b>
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl" id="orged9430a">      genr time
</pre>
</div></li>
</ul>

<p>
Selecione con el ratón la variable <code>time</code> y luego pulse en el menú desplegable <b><i><code>Añadir</code></i></b> que aparece arriba, en el centro de la
ventana principal de <a href="https://gretl.sourceforge.net/es.html">Gretl</a>.
</p>
<ul class="org-ul">
<li><p>
<b><i><code>Añadir -&gt; Cuadrados de las variables seleccionadas</code></i></b>
</p>

<p>
<i>o bien teclee en linea de comandos</i>: 
</p>
<div class="org-src-container">
<pre class="src src-hansl" id="orgfd785ed">      square time
</pre>
</div></li>
</ul>
</div>
</div>
