Practicas/PracticasGretl/pub/Prct-Lecc02.tex
% Created 2024-09-17 mar 13:14
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, ]{babel}
\usepackage[margin=0.5in]{geometry}
\usepackage[svgnames,x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
\PassOptionsToPackage{hyphens}{url}
\usepackage{nacal}
\usepackage{framed}
\usepackage{listings}
\input{hansl.tex}
\lstnewenvironment{hansl-gretl}
{\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
{}
\newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
\lstset{backgroundcolor=\color{lightgray!20}, }
\author{Marcos Bujosa}
\date{\today}
\title{Lección 2}
\begin{document}

\maketitle
\tableofcontents



\section{Componentes no observables del número de viajeros internacionales}
\label{sec:org6f2bd9e}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/EconometriaAplicada-SRC/blob/main/Practicas/PracticasGretl/pub/scripts/componentesAirlinePass.inp}{componentesAirlinePass.inp}\\[0pt]
\end{tabular}
\end{center}

Vamos a reproducir el ejemplo de estimación de componentes no
observables visto en clase. Los datos son mensuales y contienen el
número de viajeros internacionales (en miles) en las líneas aéreas
norteamericanas en los años 1949--1960 que aparece en manual de Box \&
Jenkins.

\begin{enumerate}
\item Objetivo
\label{sec:org733ba9a}
\begin{enumerate}
\item Reproducir el ejemplo visto en la lección 2.
\end{enumerate}

\item Carga de datos
\label{sec:orga19a3b2}
\textbf{\emph{\texttt{Archivo -{}-{}> Abrir datos -{}-{}> Archivo de muestra}}} y en la pestaña
\textbf{\emph{\texttt{Gretl}}} seleccione \texttt{bjg}.

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
open bjg
\end{verbatim}
}
\end{enumerate}

\subsection{Actividad 1 - generar una serie con el índice temporal y su cuadrado}
\label{sec:org9500fa3}
Pulse en el menú desplegable \textbf{\emph{\texttt{Añadir}}} que aparece arriba, en el centro de la
ventana principal de \href{https://gretl.sourceforge.net/es.html}{Gretl}.
\begin{itemize}
\item \textbf{\emph{\texttt{Añadir -> Variable índices}}}

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
genr time
\end{verbatim}
}
\end{itemize}

Seleccione con el ratón la variable \texttt{time} y luego pulse en el menú desplegable \textbf{\emph{\texttt{Añadir}}} que aparece arriba, en el centro de la
ventana principal de \href{https://gretl.sourceforge.net/es.html}{Gretl}.
\begin{itemize}
\item \textbf{\emph{\texttt{Añadir -> Cuadrados de las variables seleccionadas}}}

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}: 
\begin{verbatim}
square time
\end{verbatim}
}
\end{itemize}

\vspace{-3pt}
