Practicas/PracticasGretl/Prct-Lecc02.org
** Actividad 2 - Ajustar una tendencia lineal
#+ATTR_BEAMER: :overlay <+->
- Estime el modelo mediante los menús desplegables: */~Modelo ->
  Mínimos Cuadrados Ordinarios~/*; indique a [[https://gretl.sourceforge.net/es.html][Gretl]] el regresando y los
  regresores y pulse */~Aceptar~/*.
  
- ``Pinche'' */~Archivo~/* en la ventana del modelo estimado y
  seleccione */~guardar como un icono y cerrar~/*

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl
    TendenciaLineal  <- ols lg 0 time
    #+end_src
    (/el cero/ =0= /indica el término constante/: =const=)
  #+latex: }
  
- Recupere el modelo ``pinchando'' sobre su icono

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o teclee en linea de comandos el nombre que ha dado al icono
  seguido de/ =.show=, /es decir/:
    #+NAME: Mostramos la ventana del ajuste MCO
    #+begin_src hansl 
    TendenciaLineal.show
    #+end_src
  #+latex: }

***** Recuperemos los valores ajustados 
    :PROPERTIES:
    :BEAMER_ENV: block
    :BEAMER_ACT: <+->
    :END:
    
- Desde la ventana del modelo ajustado (recupérese con su icono),
  ``pinche'' en */~guardar -> valores estimados~/*. Elija como nombre
  =phat= (puede añadir una descripción de la variable). Pulse en
  */~Aceptar~/*
- Repita para guardar los =residuos= con el nombre =ehat=
  
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+NAME: Guardamos las series de valores ajustados y de errores
    #+begin_src hansl 
    series TendenciaLineal =  $yhat
    series Comp_irregular =  $uhat
    #+end_src
  #+latex: }


***** Gráfico de la serie y la tendencia lineal
- Marque las variables =lg= y =Tendencia= (pulsando ~ctrl~). Pinche
  con el botón derecho del ratón sobre ellas. Elija */~Gráfico de
  series temporales~/*

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl 
    GraficoTendenciaLineal <- gnuplot lg TendenciaLineal --time-series --with-lines
    GraficoTendenciaLineal.show
    #+end_src
  #+latex: }
  
En la zona inferior izquierda de la ventana principal puede ver una
serie de iconos. Uno de ellos es la */~vista de iconos de sesión~/*.


***** Gráfico del componente irregular

- Marque la variable correspondiente al componente irregular (pulsando
  ~ctrl~) y pinche con el botón derecho del ratón sobre ella. Elija
  */~Gráfico de series temporales~/*

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl 
    GraficoComponenteIrregular <- gnuplot Comp_irregular --time-series --with-lines
    GraficoComponenteIrregular.show
    #+end_src
  #+latex: }

***** Gráfico de la diferencia estacional del componente irregular

- Seleccione con el ratón la variable correspondiente al componente
  irregular y luego pulse en el menú desplegable */~Añadir~/* que
  aparece arriba, en el centro de la ventana principal de [[https://gretl.sourceforge.net/es.html][Gretl]].
    + */~Añadir -> Diferencias estacionales de las variables
      seleccionadas~/*

  #+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/: 
    #+begin_src hansl 
    sdiff Comp_irregular
    #+end_src
  #+latex: }

- Genere un gráfico con la nueva serie diferenciada estacionalmente

  #+latex: {\vspace{0pt} \footnotesize \color{gray!70!black} 
  /en linea de comandos/: 
    #+begin_src hansl 
    GraficoComponenteIrregularD12 <- gnuplot sd_Comp_irregular --time-series --with-lines
    GraficoComponenteIrregularD12.show
    #+end_src
  #+latex: }


** Actividad 3 - Ajustar una tendencia cuadrática

Repita el ejercicio anterior, pero ajustando una tendencia cuadrática

- Estime la tendencia por MCO y vea los resultados de la regresión
- Guarde los valores ajustados (TendenciaCuadratica)
- Guarde los residuos (ComponenteIrregular2)
- Dibuje la tendencia
- Dibuje el componente irregular
- Dibuje la diferencia estacional del componente irregular
  
#+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
  #+NAME: Guardamos las series de valores ajustados y de errores
  #+begin_src hansl :exports none
  # modelo con tendencia cuadrática
  TendenciaCuadratica  <- ols lg 0 time sq_time
  TendenciaCuadratica.show
    
  series TendenciaCuadratica =  $yhat
  series Comp_irregular2 =  $uhat

  GraficoTendenciaCuadratica <- gnuplot lg TendenciaCuadratica --time-series --with-lines
  GraficoTendenciaCuadratica.show

  GraficoComponenteIrregular2 <- gnuplot Comp_irregular2 --time-series --with-lines
  GraficoComponenteIrregular2.show

  sdiff Comp_irregular2

  GraficoComponenteIrregular2D12 <- gnuplot sd_Comp_irregular2 --time-series --with-lines
  GraficoComponenteIrregular2D12.show
  #+end_src
#+latex: }


