docs/Practicas/PracticasGretl/Prct-Lecc02.html
<div id="outline-container-org3901aa5" class="outline-3">
<h3 id="org3901aa5"><span class="section-number-3">1.2.</span> Actividad 2 - Ajustar una tendencia lineal</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Estime el modelo mediante los menús desplegables: <b><i><code>Modelo -&gt;
  Mínimos Cuadrados Ordinarios</code></i></b>; indique a <a href="https://gretl.sourceforge.net/es.html">Gretl</a> el regresando y los
regresores y pulse <b><i><code>Aceptar</code></i></b>.</li>

<li><p>
``Pinche'' <b><i><code>Archivo</code></i></b> en la ventana del modelo estimado y
seleccione <b><i><code>guardar como un icono y cerrar</code></i></b>
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    TendenciaLineal  &lt;- ols lg 0 time
</pre>
</div>
<p>
(<i>el cero</i> <code>0</code> <i>indica el término constante</i>: <code>const</code>)
</p></li>

<li><p>
Recupere el modelo ``pinchando'' sobre su icono
</p>

<p>
<i>o teclee en linea de comandos el nombre que ha dado al icono
seguido de</i> <code>.show</code>, <i>es decir</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl" id="org74c09a6">    TendenciaLineal.show
</pre>
</div></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org9d0ec8b"></a>Recuperemos los valores ajustados<br />
<div class="outline-text-6" id="text-1-2-0-0-1">
<ul class="org-ul">
<li>Desde la ventana del modelo ajustado (recupérese con su icono),
``pinche'' en <b><i><code>guardar -&gt; valores estimados</code></i></b>. Elija como nombre
<code>phat</code> (puede añadir una descripción de la variable). Pulse en
<b><i><code>Aceptar</code></i></b></li>
<li><p>
Repita para guardar los <code>residuos</code> con el nombre <code>ehat</code>
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl" id="org4a794c1">    series TendenciaLineal =  $yhat
    series Comp_irregular =  $uhat
</pre>
</div></li>
</ul>
</div>
</li>
<li><a id="org25f0872"></a>Gráfico de la serie y la tendencia lineal<br />
<div class="outline-text-6" id="text-1-2-0-0-2">
<ul class="org-ul">
<li><p>
Marque las variables <code>lg</code> y <code>Tendencia</code> (pulsando <code>ctrl</code>). Pinche
con el botón derecho del ratón sobre ellas. Elija <b><i><code>Gráfico de
  series temporales</code></i></b>
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    GraficoTendenciaLineal &lt;- gnuplot lg TendenciaLineal --time-series --with-lines
    GraficoTendenciaLineal.show
</pre>
</div></li>
</ul>

<p>
En la zona inferior izquierda de la ventana principal puede ver una
serie de iconos. Uno de ellos es la <b><i><code>vista de iconos de sesión</code></i></b>.
</p>
</div>
</li>
<li><a id="org5180445"></a>Gráfico del componente irregular<br />
<div class="outline-text-6" id="text-1-2-0-0-3">
<ul class="org-ul">
<li><p>
Marque la variable correspondiente al componente irregular (pulsando
<code>ctrl</code>) y pinche con el botón derecho del ratón sobre ella. Elija
<b><i><code>Gráfico de series temporales</code></i></b>
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    GraficoComponenteIrregular &lt;- gnuplot Comp_irregular --time-series --with-lines
    GraficoComponenteIrregular.show
</pre>
</div></li>
</ul>
</div>
</li>
<li><a id="orgba80dd1"></a>Gráfico de la diferencia estacional del componente irregular<br />
<div class="outline-text-6" id="text-1-2-0-0-4">
<ul class="org-ul">
<li><p>
Selecione con el ratón la variable correspondiente al componente
irregular y luego pulse en el menú desplegable <b><i><code>Añadir</code></i></b> que
aparece arriba, en el centro de la ventana principal de <a href="https://gretl.sourceforge.net/es.html">Gretl</a>.
</p>
<ul class="org-ul">
<li><b><i><code>Añadir -&gt; Diferencias estacionales de las variables
      seleccionadas</code></i></b></li>
</ul>

<p>
<i>o bien teclee en linea de comandos</i>: 
</p>
<div class="org-src-container">
<pre class="src src-hansl">    sdiff Comp_irregular
</pre>
</div></li>

<li><p>
Genere un gráfico con la nueva serie diferenciada estacionalmente
</p>

<p>
<i>en linea de comandos</i>: 
</p>
<div class="org-src-container">
<pre class="src src-hansl">    GraficoComponenteIrregularD12 &lt;- gnuplot sd_Comp_irregular --time-series --with-lines
    GraficoComponenteIrregularD12.show
</pre>
</div></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org33f6491" class="outline-3">
<h3 id="org33f6491"><span class="section-number-3">1.3.</span> Actividad 3 - Ajustar una tendencia cuadrática</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Repita el ejercicio anterior, pero ajustando una tendencia cuadrática
</p>

<ul class="org-ul">
<li>Estime la tendencia por MCO y vea los resultados de la regresión</li>
<li>Guarde los valores ajustados (TendenciaCuadratica)</li>
<li>Guarde los residuos (ComponenteIrregular2)</li>
<li>Dibuje la tendencia</li>
<li>Dibuje el componente irregular</li>
<li>Dibuje la diferencia estacional del componente irregular</li>
</ul>
</div>
</div>
