Practicas/PracticasGretl/pub/Prct-Lecc02.tex

\subsection{Actividad 2 - Ajustar una tendencia lineal}
\label{sec:orga5aaf26}
\begin{itemize}
\item Estime el modelo mediante los menús desplegables: \textbf{\emph{\texttt{Modelo ->
  Mínimos Cuadrados Ordinarios}}}; indique a \href{https://gretl.sourceforge.net/es.html}{Gretl} el regresando y los
regresores y pulse \textbf{\emph{\texttt{Aceptar}}}.

\item ``Pinche'' \textbf{\emph{\texttt{Archivo}}} en la ventana del modelo estimado y
seleccione \textbf{\emph{\texttt{guardar como un icono y cerrar}}}

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
TendenciaLineal  <- ols lg 0 time
\end{verbatim}
(\emph{el cero} \texttt{0} \emph{indica el término constante}: \texttt{const})
}

\item Recupere el modelo ``pinchando'' sobre su icono

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o teclee en linea de comandos el nombre que ha dado al icono
seguido de} \texttt{.show}, \emph{es decir}:
\begin{verbatim}
TendenciaLineal.show
\end{verbatim}
}
\end{itemize}

\begin{enumerate}
\item Recuperemos los valores ajustados
\label{sec:orgcd65ad1}
\begin{itemize}
\item Desde la ventana del modelo ajustado (recupérese con su icono),
``pinche'' en \textbf{\emph{\texttt{guardar -> valores estimados}}}. Elija como nombre
\texttt{phat} (puede añadir una descripción de la variable). Pulse en
\textbf{\emph{\texttt{Aceptar}}}
\item Repita para guardar los \texttt{residuos} con el nombre \texttt{ehat}

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
series TendenciaLineal =  $yhat
series Comp_irregular =  $uhat
\end{verbatim}
}
\end{itemize}


\item Gráfico de la serie y la tendencia lineal
\label{sec:org74dc6b3}
\begin{itemize}
\item Marque las variables \texttt{lg} y \texttt{Tendencia} (pulsando \texttt{ctrl}). Pinche
con el botón derecho del ratón sobre ellas. Elija \textbf{\emph{\texttt{Gráfico de
  series temporales}}}

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
GraficoTendenciaLineal <- gnuplot lg TendenciaLineal --time-series --with-lines
GraficoTendenciaLineal.show
\end{verbatim}
}
\end{itemize}

En la zona inferior izquierda de la ventana principal puede ver una
serie de iconos. Uno de ellos es la \textbf{\emph{\texttt{vista de iconos de sesión}}}.


\item Gráfico del componente irregular
\label{sec:orga31ea9b}

\begin{itemize}
\item Marque la variable correspondiente al componente irregular (pulsando
\texttt{ctrl}) y pinche con el botón derecho del ratón sobre ella. Elija
\textbf{\emph{\texttt{Gráfico de series temporales}}}

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
GraficoComponenteIrregular <- gnuplot Comp_irregular --time-series --with-lines
GraficoComponenteIrregular.show
\end{verbatim}
}
\end{itemize}

\item Gráfico de la diferencia estacional del componente irregular
\label{sec:orgcb072b9}

\begin{itemize}
\item Seleccione con el ratón la variable correspondiente al componente
irregular y luego pulse en el menú desplegable \textbf{\emph{\texttt{Añadir}}} que
aparece arriba, en el centro de la ventana principal de \href{https://gretl.sourceforge.net/es.html}{Gretl}.
\begin{itemize}
\item \textbf{\emph{\texttt{Añadir -> Diferencias estacionales de las variables
      seleccionadas}}}
\end{itemize}

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}: 
\begin{verbatim}
sdiff Comp_irregular
\end{verbatim}
}

\item Genere un gráfico con la nueva serie diferenciada estacionalmente

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{en linea de comandos}: 
\begin{verbatim}
GraficoComponenteIrregularD12 <- gnuplot sd_Comp_irregular --time-series --with-lines
GraficoComponenteIrregularD12.show
\end{verbatim}
}
\end{itemize}
\end{enumerate}


\subsection{Actividad 3 - Ajustar una tendencia cuadrática}
\label{sec:org9173245}

Repita el ejercicio anterior, pero ajustando una tendencia cuadrática

\begin{itemize}
\item Estime la tendencia por MCO y vea los resultados de la regresión
\item Guarde los valores ajustados (TendenciaCuadratica)
\item Guarde los residuos (ComponenteIrregular2)
\item Dibuje la tendencia
\item Dibuje el componente irregular
\item Dibuje la diferencia estacional del componente irregular
\end{itemize}

{\vspace{1pt} \footnotesize \color{gray!70!black}
}
