Practicas/PracticasGretl/Prct-Lecc02.org
** Actividad 4 - Ajustar una tendencia cuadrática y un componente estacional determinista

#+begin_src hansl :exports none
# modelo con tendencia cuadrática
#+end_src

Pulse en el menú desplegable */~Añadir~/* que aparece arriba, en el centro de la
ventana principal de [[https://gretl.sourceforge.net/es.html][Gretl]].
  + */~Añadir -> Variables ficticias estacionales~/*

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+NAME: Mostramos los valores de los datos en columna
    #+begin_src hansl 
    seasonals()
    #+end_src
  #+latex: }

- Estime el modelo mediante los menús desplegables: */~Modelo ->
  Mínimos Cuadrados Ordinarios~/*; indique a [[https://gretl.sourceforge.net/es.html][Gretl]] el regresando y los
  regresores y pulse */~Aceptar~/*.
  
- ``Pinche'' */~Archivo~/* en la ventana del modelo estimado y
  seleccione */~guardar como un icono y cerrar~/*

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl
    ModeloCompleto  <- ols lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11
    ModeloCompleto.show
    #+end_src
  #+latex: }

***** Genere una nueva serie con la tendencia y otra con el componente estacional estimados
    :PROPERTIES:
    :BEAMER_ENV: block
    :BEAMER_ACT: <+->
    :END:

- Cálculo de la tendencia estimada: \Estmc{\beta_1} =const= + \Estmc{\beta_2} =time= + \Estmc{\beta_3} =sq_time=
    
  */~Guardar -> Definir una nueva variable~/* y teclee:
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
    #+begin_src hansl 
    series Tendencia3 = $coeff[1] + $coeff[2]*time + $coeff[3]*sq_time
    #+end_src
  #+latex: }
  o bien:
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
    #+begin_src hansl 
    series Tendencia3 = $coeff(const) + $coeff(time)*time + $coeff(sq_time)*sq_time
    #+end_src
  #+latex: }

- De manera análoga genere una serie con el componente estacional

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
    #+begin_src hansl 
    series Comp_Estacional3 = $coeff(S1)*S1 + $coeff(S2)*S2 + $coeff(S3)*S3 + $coeff(S4)*S4 \
                            + $coeff(S5)*S5 + $coeff(S6)*S6 + $coeff(S7)*S7 + $coeff(S8)*S8 \
                            + $coeff(S9)*S9 + $coeff(S10)*S10 + $coeff(S11)*S11 
    #+end_src
  #+latex: }

- Genere los siguientes gráficos
  + la serie y su tendencia cuadrática

  + El componente estacional

  + El componente irregular

  + La serie y su ajuste

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
    #+begin_src hansl 
    GraficoTendencia3 <- gnuplot lg Tendencia3 --time-series --with-lines
    GraficoTendencia3.show

    GraficoComponenteEstacional3 <- gnuplot Comp_Estacional3 --time-series --with-lines
    GraficoComponenteEstacional3.show

    series ComponenteIrregular3 = $uhat
    GraficoComponenteIrregular3 <- gnuplot ComponenteIrregular3 --time-series --with-lines
    GraficoComponenteIrregular3.show

    series Ajuste3 = $yhat
    GraficoAjuste3 <- gnuplot lg Ajuste3 --time-series --with-lines
    GraficoAjuste3.show
    #+end_src
  #+latex: }


# +LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica* ~componentesAirlinePass.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/componentesAirlinePass.inp}
#+LATEX: \clearpage


* Componentes no observables del número de viajeros internacionales 2
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/componentesAirlinePass2.inp
   :END:

   | Guión: | [[https://github.com/mbujosab/EconometriaAplicada-SRC/blob/main/Practicas/PracticasGretl/pub/scripts/componentesAirlinePass2.inp][componentesAirlinePass2.inp]] |
   
Continuamos el ejemplo anterior, pero ahora vamos a reducir el modelo
quitando variables no significativas.

** Actividad 1 - Estime el modelo con tendencia cuadrática y estacionalidad determinista

Repita la estimación del último modelo de la practica anterior

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
  #+begin_src hansl 
  open bjg
  genr time
  square time
  seasonals()
  ModeloInicial  <- ols lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11
  ModeloInicial.show
 #+end_src
#+latex: }

