docs/Practicas/PracticasGretl/Prct-Lecc02.html
<div id="outline-container-orgc098b60" class="outline-3">
<h3 id="orgc098b60"><span class="section-number-3">1.4.</span> Actividad 4 - Ajustar una tendencia cuadrática y un componente estacional determinista</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Pulse en el menú desplegable <b><i><code>Añadir</code></i></b> que aparece arriba, en el centro de la
ventana principal de <a href="https://gretl.sourceforge.net/es.html">Gretl</a>.
</p>
<ul class="org-ul">
<li><b><i><code>Añadir -&gt; Variables ficticias estacionales</code></i></b></li>
</ul>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl" id="org9c48c05">    seasonals()
</pre>
</div>
<ul class="org-ul">
<li>Estime el modelo mediante los menús desplegables: <b><i><code>Modelo -&gt;
  Mínimos Cuadrados Ordinarios</code></i></b>; indique a <a href="https://gretl.sourceforge.net/es.html">Gretl</a> el regresando y los
regresores y pulse <b><i><code>Aceptar</code></i></b>.</li>

<li><p>
``Pinche'' <b><i><code>Archivo</code></i></b> en la ventana del modelo estimado y
seleccione <b><i><code>guardar como un icono y cerrar</code></i></b>
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    ModeloCompleto  &lt;- ols lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11
    ModeloCompleto.show
</pre>
</div></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org5f44e9b"></a>Genere una nueva serie con la tendencia y otra con el componente estacional estimados<br />
<div class="outline-text-6" id="text-1-4-0-0-1">
<ul class="org-ul">
<li><p>
Cálculo de la tendencia estimada: \Estmc{\beta_1} <code>const</code> + \Estmc{\beta_2} <code>time</code> + \Estmc{\beta_3} <code>sq_time</code>
</p>

<p>
<b><i><code>Guardar -&gt; Definir una nueva variable</code></i></b> y teclee:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    series Tendencia3 = $coeff[1] + $coeff[2]*time + $coeff[3]*sq_time
</pre>
</div>
<p>
o bien:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    series Tendencia3 = $coeff(const) + $coeff(time)*time + $coeff(sq_time)*sq_time
</pre>
</div></li>

<li><p>
De manera análoga genere una serie con el componente estacional
</p>

<div class="org-src-container">
<pre class="src src-hansl">    series Comp_Estacional3 = $coeff(S1)*S1 + $coeff(S2)*S2 + $coeff(S3)*S3 + $coeff(S4)*S4 \
                            + $coeff(S5)*S5 + $coeff(S6)*S6 + $coeff(S7)*S7 + $coeff(S8)*S8 \
                            + $coeff(S9)*S9 + $coeff(S10)*S10 + $coeff(S11)*S11 
</pre>
</div></li>

<li><p>
Genere los siguientes gráficos
</p>
<ul class="org-ul">
<li>la serie y su tendencia cuadrática</li>

<li>El componente estacional</li>

<li>El componente irregular</li>

<li>La serie y su ajuste</li>
</ul>

<div class="org-src-container">
<pre class="src src-hansl">    GraficoTendencia3 &lt;- gnuplot lg Tendencia3 --time-series --with-lines
    GraficoTendencia3.show

    GraficoComponenteEstacional3 &lt;- gnuplot Comp_Estacional3 --time-series --with-lines
    GraficoComponenteEstacional3.show

    series ComponenteIrregular3 = $uhat
    GraficoComponenteIrregular3 &lt;- gnuplot ComponenteIrregular3 --time-series --with-lines
    GraficoComponenteIrregular3.show

    series Ajuste3 = $yhat
    GraficoAjuste3 &lt;- gnuplot lg Ajuste3 --time-series --with-lines
    GraficoAjuste3.show
</pre>
</div></li>
</ul>


<p>
<b>Código completo de la práctica</b> <code>componentesAirlinePass.inp</code>
</p>
<p>
\lstinputlisting{scripts/componentesAirlinePass.inp}
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgdfa1996" class="outline-2">
<h2 id="orgdfa1996"><span class="section-number-2">2.</span> Componentes no observables del número de viajeros internacionales 2</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Guión:</td>
<td class="org-left"><a href="https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/componentesAirlinePass2.inp">componentesAirlinePass2.inp</a></td>
</tr>
</tbody>
</table>

<p>
Continuamos el ejemplo anterior, pero ahora vamos a reducir el modelo
quitando variables no siginificativas.
</p>
</div>
<div id="outline-container-orge9aa59e" class="outline-3">
<h3 id="orge9aa59e"><span class="section-number-3">2.1.</span> Actividad 1 - Estime el modelo con tendencia cuadrática y estacionalidad determinista</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Repita la estimación del último modelo de la practica anterior
</p>

<div class="org-src-container">
<pre class="src src-hansl">  open bjg
  genr time
  square time
  seasonals()
  ModeloInicial  &lt;- ols lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11
  ModeloInicial.show
</pre>
</div>
</div>
</div>
