Practicas/PracticasGretl/pub/Prct-Lecc02.tex


\subsection{Actividad 4 - Ajustar una tendencia cuadrática y un componente estacional determinista}
\label{sec:org2b46e04}

Pulse en el menú desplegable \textbf{\emph{\texttt{Añadir}}} que aparece arriba, en el centro de la
ventana principal de \href{https://gretl.sourceforge.net/es.html}{Gretl}.
\begin{itemize}
\item \textbf{\emph{\texttt{Añadir -> Variables ficticias estacionales}}}
\end{itemize}

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
seasonals()
\end{verbatim}
}

\begin{itemize}
\item Estime el modelo mediante los menús desplegables: \textbf{\emph{\texttt{Modelo ->
  Mínimos Cuadrados Ordinarios}}}; indique a \href{https://gretl.sourceforge.net/es.html}{Gretl} el regresando y los
regresores y pulse \textbf{\emph{\texttt{Aceptar}}}.

\item ``Pinche'' \textbf{\emph{\texttt{Archivo}}} en la ventana del modelo estimado y
seleccione \textbf{\emph{\texttt{guardar como un icono y cerrar}}}

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
ModeloCompleto  <- ols lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11
ModeloCompleto.show
\end{verbatim}
}
\end{itemize}

\begin{enumerate}
\item Genere una nueva serie con la tendencia y otra con el componente estacional estimados
\label{sec:orgcd802ab}
\begin{itemize}
\item Cálculo de la tendencia estimada: \Estmc{\beta_1} \texttt{const} + \Estmc{\beta_2} \texttt{time} + \Estmc{\beta_3} \texttt{sq\_time}

\textbf{\emph{\texttt{Guardar -> Definir una nueva variable}}} y teclee:
{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\begin{verbatim}
series Tendencia3 = $coeff[1] + $coeff[2]*time + $coeff[3]*sq_time
\end{verbatim}
}
o bien:
{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\begin{verbatim}
series Tendencia3 = $coeff(const) + $coeff(time)*time + $coeff(sq_time)*sq_time
\end{verbatim}
}

\item De manera análoga genere una serie con el componente estacional

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\begin{verbatim}
series Comp_Estacional3 = $coeff(S1)*S1 + $coeff(S2)*S2 + $coeff(S3)*S3 + $coeff(S4)*S4 \
                        + $coeff(S5)*S5 + $coeff(S6)*S6 + $coeff(S7)*S7 + $coeff(S8)*S8 \
                        + $coeff(S9)*S9 + $coeff(S10)*S10 + $coeff(S11)*S11 
\end{verbatim}
}

\item Genere los siguientes gráficos
\begin{itemize}
\item la serie y su tendencia cuadrática

\item El componente estacional

\item El componente irregular

\item La serie y su ajuste
\end{itemize}

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\begin{verbatim}
GraficoTendencia3 <- gnuplot lg Tendencia3 --time-series --with-lines
GraficoTendencia3.show

GraficoComponenteEstacional3 <- gnuplot Comp_Estacional3 --time-series --with-lines
GraficoComponenteEstacional3.show

series ComponenteIrregular3 = $uhat
GraficoComponenteIrregular3 <- gnuplot ComponenteIrregular3 --time-series --with-lines
GraficoComponenteIrregular3.show

series Ajuste3 = $yhat
GraficoAjuste3 <- gnuplot lg Ajuste3 --time-series --with-lines
GraficoAjuste3.show
\end{verbatim}
}
\end{itemize}


\vspace{10pt}
\noindent
\textbf{Código completo de la práctica} \texttt{componentesAirlinePass.inp}
\vspace{10pt}
\lstinputlisting{scripts/componentesAirlinePass.inp}
\clearpage
\end{enumerate}


\section{Componentes no observables del número de viajeros internacionales 2}
\label{sec:org67d71e0}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/EconometriaAplicada-SRC/blob/main/Practicas/PracticasGretl/pub/scripts/componentesAirlinePass2.inp}{componentesAirlinePass2.inp}\\[0pt]
\end{tabular}
\end{center}

Continuamos el ejemplo anterior, pero ahora vamos a reducir el modelo
quitando variables no significativas.

\subsection{Actividad 1 - Estime el modelo con tendencia cuadrática y estacionalidad determinista}
\label{sec:org530e692}

Repita la estimación del último modelo de la practica anterior

{\vspace{0pt} \footnotesize \color{gray!70!black}
\begin{verbatim}
open bjg
genr time
square time
seasonals()
ModeloInicial  <- ols lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11
ModeloInicial.show
\end{verbatim}
}
