Practicas/PracticasGretl/Prct-Lecc02.org
** Actividad 2 - Reducir el modelo eliminando secuencialmente variables no significativas

Los p-valores de algunos parámetros indican que sus estimaciones son
no significativas. En particular los correspondientes a las variables
ficticias de enero, febrero y octubre.

Reduzca el modelo, eliminando aquellas variables no significativas al
5%. Verifique que el conjunto de variables excluidas es conjuntamente
no significativo.

+ Desde la ventana del modelo estimado ``pinche'' en */~contrastes -->
  omitir variables~/* y marque la opción /~Eliminación secuencial de
  variables utilizando el valor p a dos colas~/, indique una
  significación del 5% y pulse en */~Aceptar~/*
  #+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
    #+begin_src hansl 
    PrimeraReduccion <- omit --auto=0.05
    #+end_src
  #+latex: }


** Actividad 3 - Contrastar la ausencia de autocorrelación

- Observe bajo el valor de contraste de Durbin-Watson (0,691477).

- Desde la ventana del modelo estimado ``pinche'' en */~contrastes -->
  valor p del estadístico Durbin-Watson~/*. 
  #+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl 
    scalar DW = $dw
    scalar PDW = $dwpval
    print DW
    print PDW
    #+end_src
  #+latex: }

  Claramente se rechaza la ausencia de autocorrelación de orden uno.

- Desde la ventana del modelo estimado ``pinche'' en */~contrastes -->
  Autocorrelación~/*. E indique por ejemplo 3 retardos. 
  #+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl
    modtest --autocorr 3
    #+end_src
  #+latex: }

  Claramente se rechaza la ausencia de autocorrelación y se observa
  que el retardo de orden uno es muy significativo.


** Actividad 4 - Estimación del modelo con errores estándar robustos

Los test de autocorrelación indican que la inferencia empleada para
reducir el modelo es incorrecta. A la hora de calcular las
desviaciones típicas de las estimaciones hay que tener en cuenta que
las perturbaciones están autocorreladas.

- Estime el modelo inicial con errores estándar robustos: */~Modelo ->
  Mínimos Cuadrados Ordinarios~/*; indique a [[https://gretl.sourceforge.net/es.html][Gretl]] el regresando y los
  regresores; marque la opción /~Desviaciones típicas robustas~/ y
  pulse */~Aceptar~/*.

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl
    ModeloInicialDTR  <- ols lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11 --robust
    ModeloInicialDTR.show
    #+end_src
  #+latex: }

  Fíjese que al 5% de significación, solo es no significativa al
  dummie correspondiente al mes de febrero.

- Reduzca el modelo, eliminando aquellas variables no significativas
  al 5%. Verifique que el conjunto de variables excluidas es
  conjuntamente no significativo.

  Desde la ventana del modelo estimado ``pinche'' en */~contrastes -->
  omitir variables~/* y marque la opción /~Eliminación secuencial de
  variables utilizando el valor p a dos colas~/, indique una
  significación del 5% y pulse en */~Aceptar~/*
  #+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl 
    ModeloReducidoDTR <- omit --auto=0.05
    #+end_src
  #+latex: }

  Fíjese que únicamente se elimina la dummie correspondiente a
  febrero.

