docs/Practicas/PracticasGretl/Prct-Lecc02.html
<div id="outline-container-orga83b09a" class="outline-3">
<h3 id="orga83b09a"><span class="section-number-3">2.2.</span> Actividad 2 - Reducir el modelo eliminando secuencialmente variables no significativas</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Los p-valores de algunos parametros indican que sus estimaciones son
no significativas. En particular los correspondientes a las variables
ficticias de enero, febrero y octubre.
</p>

<p>
Reduzca el modelo, eliminando aquellas variables no significativas al
5%. Verifique que el conjunto de variables excluidas es conjuntamente
no significativo.
</p>

<ul class="org-ul">
<li><p>
Desde la ventana del modelo estimado ``pinche'' en <b><i><code>contrastes --&gt;
  omitir variables</code></i></b> y marque la opción <i><code>Eliminación secuencial de
  variables utilizando el valor p a dos colas</code></i>, indique una
significación del 5% y pulse en <b><i><code>Aceptar</code></i></b>
</p>
<div class="org-src-container">
<pre class="src src-hansl">    PrimeraReduccion &lt;- omit --auto=0.05
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org1b38cbd" class="outline-3">
<h3 id="org1b38cbd"><span class="section-number-3">2.3.</span> Actividad 3 - Contrastar la ausencia de autocorrelación</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Observe bajo el valor de contraste de Durbin-Watson (0,691477).</li>

<li><p>
Desde la ventana del modelo estimado ``pinche'' en <b><i><code>contrastes --&gt;
  valor p del estadistico Durbin-Watson</code></i></b>. 
</p>
<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    scalar DW = $dw
    scalar PDW = $dwpval
    print DW
    print PDW
</pre>
</div>
<p>
Claramente se rechaza la ausencia de autocorrelación de orden uno.
</p></li>

<li><p>
Desde la ventana del modelo estimado ``pinche'' en <b><i><code>contrastes --&gt;
  Autocrrelación</code></i></b>. E indique por ejemplo 3 retardos. 
</p>
<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    modtest --autocorr 3
</pre>
</div>
<p>
Claramente se rechaza la ausencia de autocorrelación y se observa
que el retardo de orden uno es muy siginificativo.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orga9fb626" class="outline-3">
<h3 id="orga9fb626"><span class="section-number-3">2.4.</span> Actividad 4 - Estimación del modelo con errores estándar robustos</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Los test de autocorrelación indican que la inferencia empleada para
reducir el modelo es incorrecta. A la hora de calcular las
desviaciones típicas de las estimaciones hay que tener en cuenta que
las perturbaciones estan autocorreladas.
</p>

<ul class="org-ul">
<li><p>
Estime el modelo inicial con errores estándar robustos: <b><i><code>Modelo -&gt;
  Mínimos Cuadrados Ordinarios</code></i></b>; indique a <a href="https://gretl.sourceforge.net/es.html">Gretl</a> el regresando y los
regresores; marque la opción <i><code>Desviaciones típicas robustas</code></i> y
pulse <b><i><code>Aceptar</code></i></b>.
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    ModeloInicialDTR  &lt;- ols lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11 --robust
    ModeloInicialDTR.show
</pre>
</div>
<p>
Fíjese que al 5% de significación, solo es no significativa al
dummie correspondeinte al mes de febrero.
</p></li>

<li><p>
Reduzca el modelo, eliminando aquellas variables no significativas
al 5%. Verifique que el conjunto de variables excluidas es
conjuntamente no significativo.
</p>

<p>
Desde la ventana del modelo estimado ``pinche'' en <b><i><code>contrastes --&gt;
  omitir variables</code></i></b> y marque la opción <i><code>Eliminación secuencial de
  variables utilizando el valor p a dos colas</code></i>, indique una
significación del 5% y pulse en <b><i><code>Aceptar</code></i></b>
</p>
<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    ModeloReducidoDTR &lt;- omit --auto=0.05
</pre>
</div>
<p>
Fíjese que únicamente se elimina la dummie correspondeinte a
febrero.
</p></li>
</ul>
</div>
</div>
