Practicas/PracticasGretl/pub/Prct-Lecc02.tex

\subsection{Actividad 2 - Reducir el modelo eliminando secuencialmente variables no significativas}
\label{sec:org3646755}

Los p-valores de algunos parámetros indican que sus estimaciones son
no significativas. En particular los correspondientes a las variables
ficticias de enero, febrero y octubre.

Reduzca el modelo, eliminando aquellas variables no significativas al
5\%. Verifique que el conjunto de variables excluidas es conjuntamente
no significativo.

\begin{itemize}
\item Desde la ventana del modelo estimado ``pinche'' en \textbf{\emph{\texttt{contrastes -{}-{}>
  omitir variables}}} y marque la opción \emph{\texttt{Eliminación secuencial de
  variables utilizando el valor p a dos colas}}, indique una
significación del 5\% y pulse en \textbf{\emph{\texttt{Aceptar}}}
{\vspace{0pt} \footnotesize \color{gray!70!black}
\begin{verbatim}
PrimeraReduccion <- omit --auto=0.05
\end{verbatim}
}
\end{itemize}


\subsection{Actividad 3 - Contrastar la ausencia de autocorrelación}
\label{sec:org027957e}

\begin{itemize}
\item Observe bajo el valor de contraste de Durbin-Watson (0,691477).

\item Desde la ventana del modelo estimado ``pinche'' en \textbf{\emph{\texttt{contrastes -{}-{}>
  valor p del estadístico Durbin-Watson}}}. 
{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
scalar DW = $dw
scalar PDW = $dwpval
print DW
print PDW
\end{verbatim}
}

Claramente se rechaza la ausencia de autocorrelación de orden uno.

\item Desde la ventana del modelo estimado ``pinche'' en \textbf{\emph{\texttt{contrastes -{}-{}>
  Autocorrelación}}}. E indique por ejemplo 3 retardos. 
{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
modtest --autocorr 3
\end{verbatim}
}

Claramente se rechaza la ausencia de autocorrelación y se observa
que el retardo de orden uno es muy significativo.
\end{itemize}


\subsection{Actividad 4 - Estimación del modelo con errores estándar robustos}
\label{sec:orge404a15}

Los test de autocorrelación indican que la inferencia empleada para
reducir el modelo es incorrecta. A la hora de calcular las
desviaciones típicas de las estimaciones hay que tener en cuenta que
las perturbaciones están autocorreladas.

\begin{itemize}
\item Estime el modelo inicial con errores estándar robustos: \textbf{\emph{\texttt{Modelo ->
  Mínimos Cuadrados Ordinarios}}}; indique a \href{https://gretl.sourceforge.net/es.html}{Gretl} el regresando y los
regresores; marque la opción \emph{\texttt{Desviaciones típicas robustas}} y
pulse \textbf{\emph{\texttt{Aceptar}}}.

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
ModeloInicialDTR  <- ols lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11 --robust
ModeloInicialDTR.show
\end{verbatim}
}

Fíjese que al 5\% de significación, solo es no significativa al
dummie correspondiente al mes de febrero.

\item Reduzca el modelo, eliminando aquellas variables no significativas
al 5\%. Verifique que el conjunto de variables excluidas es
conjuntamente no significativo.

Desde la ventana del modelo estimado ``pinche'' en \textbf{\emph{\texttt{contrastes -{}-{}>
  omitir variables}}} y marque la opción \emph{\texttt{Eliminación secuencial de
  variables utilizando el valor p a dos colas}}, indique una
significación del 5\% y pulse en \textbf{\emph{\texttt{Aceptar}}}
{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
ModeloReducidoDTR <- omit --auto=0.05
\end{verbatim}
}

Fíjese que únicamente se elimina la dummie correspondiente a
febrero.
\end{itemize}
