Practicas/PracticasGretl/Prct-Lecc02.org
** Actividad 4 - Estimación incluyendo en el modelo la autocorrelación de orden uno en las perturbaciones

- Re-estime el modelo incluyendo en el modelo un AR(1) para las
  perturbaciones: */~Modelo -> Series temporales univariantes ->
  Errores AR -> AR(1)~/* y pulse */~Aceptar~/*.
  
  #+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl 
    ModeloAR1  <- ar1 lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11
    ModeloAR1.show
    #+end_src
  #+latex: }

- Elimine secuencialmente las variables no significativas al 5%

  #+begin_src hansl :exports none
  ModeloAR1Reducido <- omit --auto=0.05 
  ModeloAR1Reducido.show
  #+end_src

- Haga un gráfico de los residuos y observe que "son estacionarios"
  (es decir, que tienen el aspecto de una realización de un proceso
  estacionario)
  #+begin_src hansl :exports none
  series Residuos = $uhat
  GraficoResiduos <- gnuplot Residuos --time-series --with-lines
  GraficoResiduos.show
  #+end_src

- Haga un gráfico de frecuencias de los residuos y observe que tiene
  la forma campaniforme compatible con una distribución gaussiana.

  Marque con el ratón la variable =Residuos= y pinchado en la serie
  marcada con el botón derecho del ratón seleccione */~Distribución de
  frecuencias~/*.

  #+latex: {\vspace{3pt} \color{gray!70!black}
  /O bien mediante el comando/
    #+begin_src hansl
    freq Residuos --show-plot
    #+end_src
  #+latex: }
  donde ~--show-plot~ indica que se genere el gráfico en una
  ventana. Observe que dicho comando también genera una ventana de texto
  con la distribución de frecuencias relativa y acumulada.

  #+begin_src hansl :exports none
  series Residuos = $uhat
  GraficoResiduos <- gnuplot Residuos --time-series --with-lines
  GraficoResiduos.show
  #+end_src
  

- Realice el contraste de normalidad de los residuos: Desde la ventana
  del modelo estimado ``pinche'' en */~contrastes --> Normalidad de
  los residuos~/* y marque la opción /~Eliminación secuencial de
  variables utilizando el valor p a dos colas~/, indique una
  significación del 5% y pulse en */~Aceptar~/*

  O bien desde la ventana principal: marque la variable =Residuos= y
  ``pinche'' en */~Variable --> Contraste de Normalidad~/*

  #+latex: {\vspace{3pt} \color{gray!70!black}
  /O bien mediante el comando/
    #+begin_src hansl
    normtest Residuos --all
    #+end_src
  #+latex: }


# +LATEX: \clearpage
#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica* ~componentesAirlinePass2.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/componentesAirlinePass2.inp}
#+LATEX: \clearpage
  

