docs/Practicas/PracticasGretl/Prct-Lecc02.html
<div id="outline-container-org5729c0a" class="outline-3">
<h3 id="org5729c0a"><span class="section-number-3">2.5.</span> Actividad 4 - Estimación incluyendo en el modelo la autocorrelación de orden uno en las perturbaciones</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li><p>
Re-estime el modelo incluyendo en el modelo un AR(1) para las
perturbaciones: <b><i><code>Modelo -&gt; Series temporales univariantes -&gt;
  Errores AR -&gt; AR(1)</code></i></b> y pulse <b><i><code>Aceptar</code></i></b>.
</p>

<p>
<i>o bien teclee en linea de comandos</i>:
</p>
<div class="org-src-container">
<pre class="src src-hansl">    ModeloAR1  &lt;- ar1 lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11
    ModeloAR1.show
</pre>
</div></li>

<li>Elimine secuencialmente las variables no significativas al 5%</li>

<li>Haga un gráfico de los residuos y observe que "son estacionarios"
(es decir, que tienen el aspecto de una realización de un proceso
estacionario)</li>
<li><p>
Haga un gráfico de frecuencias de los residuos y observe que tiene
la forma campaniforme compatible con una distribución gaussiana.
</p>

<p>
Marque con el ratón la variable <code>Residuos</code> y pinchado en la serie
marcada con el botón derecho del ratón seleccione <b><i><code>Distribución de
  frecuencias</code></i></b>.
</p>

<p>
<i>O bien mediante el comando</i>
</p>
<div class="org-src-container">
<pre class="src src-hansl">    freq Residuos --show-plot
</pre>
</div>
<p>
donde <code>--show-plot</code> indica que se genere el gráfico en una
ventana. Observe que dicho comando también genera una ventana de texto
con la distribución de frecuencias relativa y acumulada.
</p></li>

<li><p>
Realice el contraste de normalidad de los residuos: Desde la ventana
del modelo estimado ``pinche'' en <b><i><code>contrastes --&gt; Normalidad de
  los residuos</code></i></b> y marque la opción <i><code>Eliminación secuencial de
  variables utilizando el valor p a dos colas</code></i>, indique una
significación del 5% y pulse en <b><i><code>Aceptar</code></i></b>
</p>

<p>
O bien desde la ventana principal: marque la variable <code>Residuos</code> y
``pinche'' en <b><i><code>Variable --&gt; Contraste de Normalidad</code></i></b>
</p>

<p>
<i>O bien mediante el comando</i>
</p>
<div class="org-src-container">
<pre class="src src-hansl">    normtest Residuos --all
</pre>
</div></li>
</ul>


<p>
<b>Código completo de la práctica</b> <code>componentesAirlinePass2.inp</code>
</p>
<p>
\lstinputlisting{scripts/componentesAirlinePass2.inp}
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marcos Bujosa</p>
<p class="date">Created: 2024-08-24 sáb 17:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
