Practicas/PracticasGretl/pub/Prct-Lecc02.tex

\subsection{Actividad 4 - Estimación incluyendo en el modelo la autocorrelación de orden uno en las perturbaciones}
\label{sec:org63fba2b}

\begin{itemize}
\item Re-estime el modelo incluyendo en el modelo un AR(1) para las
perturbaciones: \textbf{\emph{\texttt{Modelo -> Series temporales univariantes ->
  Errores AR -> AR(1)}}} y pulse \textbf{\emph{\texttt{Aceptar}}}.

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
ModeloAR1  <- ar1 lg const time sq_time S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11
ModeloAR1.show
\end{verbatim}
}

\item Elimine secuencialmente las variables no significativas al 5\%

\item Haga un gráfico de los residuos y observe que "son estacionarios"
(es decir, que tienen el aspecto de una realización de un proceso
estacionario)
\item Haga un gráfico de frecuencias de los residuos y observe que tiene
la forma campaniforme compatible con una distribución gaussiana.

Marque con el ratón la variable \texttt{Residuos} y pinchado en la serie
marcada con el botón derecho del ratón seleccione \textbf{\emph{\texttt{Distribución de
  frecuencias}}}.

{\vspace{3pt} \color{gray!70!black}
\emph{O bien mediante el comando}
\begin{verbatim}
freq Residuos --show-plot
\end{verbatim}
}
donde \texttt{-{}-{}show-plot} indica que se genere el gráfico en una
ventana. Observe que dicho comando también genera una ventana de texto
con la distribución de frecuencias relativa y acumulada.

\item Realice el contraste de normalidad de los residuos: Desde la ventana
del modelo estimado ``pinche'' en \textbf{\emph{\texttt{contrastes -{}-{}> Normalidad de
  los residuos}}} y marque la opción \emph{\texttt{Eliminación secuencial de
  variables utilizando el valor p a dos colas}}, indique una
significación del 5\% y pulse en \textbf{\emph{\texttt{Aceptar}}}

O bien desde la ventana principal: marque la variable \texttt{Residuos} y
``pinche'' en \textbf{\emph{\texttt{Variable -{}-{}> Contraste de Normalidad}}}

{\vspace{3pt} \color{gray!70!black}
\emph{O bien mediante el comando}
\begin{verbatim}
normtest Residuos --all
\end{verbatim}
}
\end{itemize}


\vspace{10pt}
\noindent
\textbf{Código completo de la práctica} \texttt{componentesAirlinePass2.inp}
\vspace{10pt}
\lstinputlisting{scripts/componentesAirlinePass2.inp}
\clearpage
\end{document}
